# CantPlaceInsertsError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CantPlaceInsertsError Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't place inserts outside of hosts. These elements won't be copied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantPlaceInsertsError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantPlaceInsertsError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantPlaceInsertsError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace